Revit 2024 API
Toposolid.CreateSubDivision Method
 Create a toposolid subdivision element with the current toposolid as its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public Toposolid CreateSubDivision(
	Document document,
	IList<CurveLoop> profiles
)
Visual Basic
Public Function CreateSubDivision ( _
	document As Document, _
	profiles As IList(Of CurveLoop) _
) As Toposolid
Visual C++
public:
Toposolid^ CreateSubDivision(
	Document^ document,
	IList<CurveLoop^>^ profiles
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document in which the new toposolid is created.
profiles
Type: System.Collections.Generic.IList<CurveLoop>
 An array of planar curve loops that represent the profiles of the toposolid.
Return Value
 The toposolid subdivision object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The input curve loops cannot compose a valid boundary, that means: the "curveLoops" collection is empty; or some curve loops intersect with each other; or each curve loop is not closed individually; or each curve loop is not planar; or each curve loop is not in a plane parallel to the horizontal(XY) plane; or input curves contain at least one helical curve.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Toposolid Class
Autodesk.Revit.DB Namespace